/****************************************************
 *   QQFeeder智能自动喂食器 V1.0                    *
 *   作者:zhb1190                                   *
 *   邮箱:zhb_account@163.com                       *
 *   教程:http://www.log4cpp.com/smarthome/52.html  *
 *   时间:2018-3-5                                  *
 ****************************************************/

#ifndef _CONFIGURE_H_H_
#define _CONFIGURE_H_H_

/**********************************
 *******1、WIFI热点信息设置********
 **********************************/

//WIFI的SSID
#define SSID "myssid"
//WIFI的密码
#define WIFIPASSWORD "mypassword"

/**********************************
 ******2、EEPROM地址信息设置*******
 **********************************/
 
/*
                         EEPROM内存规划表
     +------+------+------+------+------+------+------+
地址:| A+0  | A+1  | A+2  | A+3  | A+4  | A+5  | A+6  |
     +------+------+------+------+------+------+------+
用途:|定时器|定时器|定时器|定时器|定时器|定时器|电机旋|
     |1小时 |1分钟 |1秒   |2小时 |2分钟 |2秒   |转次数|
     +------+------+------+------+------+------+------+	 
*/

//EEPROM起始地址A
#define EEPROM_ADDR_BEGIN 10

/********************************
 *******3、DS1302信息设置********
 ********************************/

//DS1302连接到Arduino的引脚
#define PIN_CE 5
#define PIN_DATA 6
#define PIN_SCLK 7
 
/********************************
 ******4、步进电机信息设置*******
 ********************************/

/*电机转一圈需要的脉冲数*/
#define MOTOR_STEPS 4096
/*对应电机的橙色线*/
#define MOTOR_PIN1 8 
/*对应电机的黄色线*/
#define MOTOR_PIN2 9  
/*对应电机的粉色线*/ 
#define MOTOR_PIN3 10  
/*对应电机的蓝色线*/
#define MOTOR_PIN4 11  

/*步进电机转动速度*
#define MOTOR_SPEED 10
 
/********************************
 ********5、闹钟信息设置*********
 ********************************/
/*闹钟时间设置{小时,分钟,秒}*/
#define ALARM_ONE {7,40,55}
#define ALARM_TWO {23,02,00}

/*闹钟响时电机旋转的圈数*/
#define ALARM_STEP 1
 
/********************************
 *******6、云端服务器设置********
 ********************************/
 
/*云端服务器地址*/
#define CLOUND_SERVER "localhost"
#define CLOUND_PORT 80

#endif